; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl4)
	(at plane2 city3)
	(fuel-level plane2 fl4)
	(at plane3 city11)
	(fuel-level plane3 fl5)
	(at plane4 city5)
	(fuel-level plane4 fl2)
	(at plane5 city8)
	(fuel-level plane5 fl6)
	(at plane6 city5)
	(fuel-level plane6 fl5)
	(at plane7 city13)
	(fuel-level plane7 fl0)
	(at person1 city8)
	(at person2 city13)
	(at person3 city10)
	(at person4 city2)
	(at person5 city5)
	(at person6 city11)
	(at person7 city9)
	(at person8 city3)
	(at person9 city8)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane3 city0)
	(at plane7 city7)
	(at person1 city0)
	(at person2 city5)
	(at person3 city8)
	(at person4 city13)
	(at person5 city1)
	(at person6 city2)
	(at person7 city10)
	(at person8 city6)
	(at person9 city0)
	))

)

; plan
1. (refuel plane7 city13 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 0 of 11
2. (board person2 plane7 city13)
   deleted: (at person2 city13)
   added: (in person2 plane7)
   goals met: 0 of 11
3. (board person9 plane5 city8)
   deleted: (at person9 city8)
   added: (in person9 plane5)
   goals met: 0 of 11
4. (board person1 plane5 city8)
   deleted: (at person1 city8)
   added: (in person1 plane5)
   goals met: 0 of 11
5. (zoom plane5 city8 city0 fl6 fl5 fl4)
   deleted: (at plane5 city8) (fuel-level plane5 fl6)
   added: (at plane5 city0) (fuel-level plane5 fl4)
   goals met: 0 of 11
6. (debark person9 plane5 city0)
   deleted: (in person9 plane5)
   added: (at person9 city0)
   goals met: 1 of 11
7. (debark person1 plane5 city0)
   deleted: (in person1 plane5)
   added: (at person1 city0)
   goals met: 2 of 11
8. (board person5 plane4 city5)
   deleted: (at person5 city5)
   added: (in person5 plane4)
   goals met: 2 of 11
9. (zoom plane4 city5 city1 fl2 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl2)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 2 of 11
10. (debark person5 plane4 city1)
   deleted: (in person5 plane4)
   added: (at person5 city1)
   goals met: 3 of 11
11. (board person6 plane3 city11)
   deleted: (at person6 city11)
   added: (in person6 plane3)
   goals met: 3 of 11
12. (zoom plane3 city11 city0 fl5 fl4 fl3)
   deleted: (at plane3 city11) (fuel-level plane3 fl5)
   added: (at plane3 city0) (fuel-level plane3 fl3)
   goals met: 4 of 11
13. (zoom plane3 city0 city2 fl3 fl2 fl1)
   deleted: (at plane3 city0) (fuel-level plane3 fl3)
   added: (at plane3 city2) (fuel-level plane3 fl1)
   goals met: 3 of 11
14. (debark person6 plane3 city2)
   deleted: (in person6 plane3)
   added: (at person6 city2)
   goals met: 4 of 11
15. (board person4 plane3 city2)
   deleted: (at person4 city2)
   added: (in person4 plane3)
   goals met: 4 of 11
16. (board person8 plane2 city3)
   deleted: (at person8 city3)
   added: (in person8 plane2)
   goals met: 4 of 11
17. (zoom plane2 city3 city6 fl4 fl3 fl2)
   deleted: (at plane2 city3) (fuel-level plane2 fl4)
   added: (at plane2 city6) (fuel-level plane2 fl2)
   goals met: 4 of 11
18. (debark person8 plane2 city6)
   deleted: (in person8 plane2)
   added: (at person8 city6)
   goals met: 5 of 11
19. (fly plane7 city13 city5 fl1 fl0)
   deleted: (at plane7 city13) (fuel-level plane7 fl1)
   added: (at plane7 city5) (fuel-level plane7 fl0)
   goals met: 5 of 11
20. (refuel plane7 city5 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 5 of 11
21. (debark person2 plane7 city5)
   deleted: (in person2 plane7)
   added: (at person2 city5)
   goals met: 6 of 11
22. (fly plane7 city5 city7 fl1 fl0)
   deleted: (at plane7 city5) (fuel-level plane7 fl1)
   added: (at plane7 city7) (fuel-level plane7 fl0)
   goals met: 7 of 11
23. (fly plane3 city2 city0 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 8 of 11
24. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 11
25. (zoom plane1 city0 city10 fl4 fl3 fl2)
   deleted: (at plane1 city0) (fuel-level plane1 fl4)
   added: (at plane1 city10) (fuel-level plane1 fl2)
   goals met: 8 of 11
26. (board person3 plane1 city10)
   deleted: (at person3 city10)
   added: (in person3 plane1)
   goals met: 8 of 11
27. (zoom plane1 city10 city8 fl2 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl2)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 8 of 11
28. (debark person3 plane1 city8)
   deleted: (in person3 plane1)
   added: (at person3 city8)
   goals met: 9 of 11
29. (zoom plane2 city6 city9 fl2 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl2)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 9 of 11
30. (zoom plane5 city0 city9 fl4 fl3 fl2)
   deleted: (at plane5 city0) (fuel-level plane5 fl4)
   added: (at plane5 city9) (fuel-level plane5 fl2)
   goals met: 9 of 11
31. (board person7 plane5 city9)
   deleted: (at person7 city9)
   added: (in person7 plane5)
   goals met: 9 of 11
32. (zoom plane5 city9 city10 fl2 fl1 fl0)
   deleted: (at plane5 city9) (fuel-level plane5 fl2)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 9 of 11
33. (debark person7 plane5 city10)
   deleted: (in person7 plane5)
   added: (at person7 city10)
   goals met: 10 of 11
34. (fly plane3 city0 city13 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 9 of 11
35. (refuel plane3 city13 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 9 of 11
36. (debark person4 plane3 city13)
   deleted: (in person4 plane3)
   added: (at person4 city13)
   goals met: 10 of 11
37. (fly plane3 city13 city0 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 11 of 11
